---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.HasMiddleSupports
source: html/b03dbd12-f514-05bd-e2c4-b1f63e276521.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.HasMiddleSupports Property

True if the stairs type has middle supports, False otherwise.

## Syntax (C#)
```csharp
public bool HasMiddleSupports { get; set; }
```